Tekla Open API Reference for Tekla Structures 2025
Matrix.Transform Method (IEnumerable<Point>)
 Transforms the given points using the current matrix.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerable<Point> Transform(
	IEnumerable<Point> Points
)
Public Function Transform (
	Points As IEnumerable(Of Point)
) As IEnumerable(Of Point)
Parameters
Points
Type: System.Collections.Generic.IEnumerable<Point>
The points to be transformed.
Return Value
Type: IEnumerable<Point>
The new transformed points.
See Also
Reference
Matrix Class
Transform Overload
Tekla.Structures.Geometry3d Namespace